zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_QSPI.h
#define QSPI_SPDSR_SSB_DDR_MASK                  (0x80U)
#define QSPI_SPDSR_SSB_DDR_SHIFT                 (7U)
/*! SSB_DDR - SS_B Data Direction
 *  0b0..SS_B is configured as an input pin. Use this setting in slave mode or in master mode with MODFEN=1.
 *  0b1..SS_B is configured as an output pin. Use this setting in master mode with MODFEN=0.
 */
#define QSPI_SPDSR_SSB_DDR(x)                    (((uint16_t)(((uint16_t)(x)) << QSPI_SPDSR_SSB_DDR_SHIFT)) & QSPI_SPDSR_SSB_DDR_MASK)

#define QSPI_SPDSR_SSB_AUTO_MASK                 (0x100U)
#define QSPI_SPDSR_SSB_AUTO_SHIFT                (8U)
/*! SSB_AUTO - SS_B Automatic Mode
 *  0b0..SS_B output signal is software generated by directly manipulating the various bits in this register or
 *       the GPIO registers (compatible with legacy SPI software).
 *  0b1..SS_B output signal is hardware generated to create the initial falling edge and final rising edge. The
 *       idle state of the SS_B is high. Do not use if MODFEN = 1.
 */
#define QSPI_SPDSR_SSB_AUTO(x)                   (((uint16_t)(((uint16_t)(x)) << QSPI_SPDSR_SSB_AUTO_SHIFT)) & QSPI_SPDSR_SSB_AUTO_MASK)

#define QSPI_SPDSR_SSB_ODM_MASK                  (0x200U)
#define QSPI_SPDSR_SSB_ODM_SHIFT                 (9U)
/*! SSB_ODM - SS_B Open Drain Mode
 *  0b0..SS_B is configured for high and low drive. This mode is generally used in single master systems.
 *  0b1..SS_B is configured as an open drain pin (only drives low output level). This mode is useful for multiple master systems.
 */
#define QSPI_SPDSR_SSB_ODM(x)                    (((uint16_t)(((uint16_t)(x)) << QSPI_SPDSR_SSB_ODM_SHIFT)) & QSPI_SPDSR_SSB_ODM_MASK)

#define QSPI_SPDSR_SSB_DATA_MASK                 (0x400U)
#define QSPI_SPDSR_SSB_DATA_SHIFT                (10U)
/*! SSB_DATA - SS_B Data
 *  0b0..SS_B pin is driven low if SSB_DDR=1
 *  0b1..SS_B pin is driven high if SSB_DDR=1
 */
#define QSPI_SPDSR_SSB_DATA(x)                   (((uint16_t)(((uint16_t)(x)) << QSPI_SPDSR_SSB_DATA_SHIFT)) & QSPI_SPDSR_SSB_DATA_MASK)

#define QSPI_SPDSR_SSB_IN_MASK                   (0x800U)
#define QSPI_SPDSR_SSB_IN_SHIFT                  (11U)
/*! SSB_IN - SS_B Input */
#define QSPI_SPDSR_SSB_IN(x)                     (((uint16_t)(((uint16_t)(x)) << QSPI_SPDSR_SSB_IN_SHIFT)) & QSPI_SPDSR_SSB_IN_MASK)

#define QSPI_SPDSR_BD2X_MASK                     (0x1000U)
#define QSPI_SPDSR_BD2X_SHIFT                    (12U)
/*! BD2X - Baud Divisor Times */
#define QSPI_SPDSR_BD2X(x)                       (((uint16_t)(((uint16_t)(x)) << QSPI_SPDSR_BD2X_SHIFT)) & QSPI_SPDSR_BD2X_MASK)

#define QSPI_SPDSR_RDMAEN_MASK                   (0x2000U)
#define QSPI_SPDSR_RDMAEN_SHIFT                  (13U)
/*! RDMAEN - Receive DMA Enable */
#define QSPI_SPDSR_RDMAEN(x)                     (((uint16_t)(((uint16_t)(x)) << QSPI_SPDSR_RDMAEN_SHIFT)) & QSPI_SPDSR_RDMAEN_MASK)

#define QSPI_SPDSR_TDMAEN_MASK                   (0x4000U)
#define QSPI_SPDSR_TDMAEN_SHIFT                  (14U)
/*! TDMAEN - Transmit DMA Enable */
#define QSPI_SPDSR_TDMAEN(x)                     (((uint16_t)(((uint16_t)(x)) << QSPI_SPDSR_TDMAEN_SHIFT)) & QSPI_SPDSR_TDMAEN_MASK)

#define QSPI_SPDSR_WOM_MASK                      (0x8000U)
#define QSPI_SPDSR_WOM_SHIFT                     (15U)
/*! WOM - Wired-OR Mode
 *  0b0..The SPI pins are configured as push-pull drivers.
 *  0b1..The SPI pins are configured as open-drain drivers with the pull-ups disabled.
 */
#define QSPI_SPDSR_WOM(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDSR_WOM_SHIFT)) & QSPI_SPDSR_WOM_MASK)
/*! @} */

/*! @name SPDRR - SPI Data Receive Register */
/*! @{ */

#define QSPI_SPDRR_R0_MASK                       (0x1U)
#define QSPI_SPDRR_R0_SHIFT                      (0U)
/*! R0 - Receive Data Bit 0 */
#define QSPI_SPDRR_R0(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R0_SHIFT)) & QSPI_SPDRR_R0_MASK)

#define QSPI_SPDRR_R1_MASK                       (0x2U)
#define QSPI_SPDRR_R1_SHIFT                      (1U)
/*! R1 - Receive Data Bit 1 */
#define QSPI_SPDRR_R1(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R1_SHIFT)) & QSPI_SPDRR_R1_MASK)

#define QSPI_SPDRR_R2_MASK                       (0x4U)
#define QSPI_SPDRR_R2_SHIFT                      (2U)
/*! R2 - Receive Data Bit 2 */
#define QSPI_SPDRR_R2(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R2_SHIFT)) & QSPI_SPDRR_R2_MASK)

#define QSPI_SPDRR_R3_MASK                       (0x8U)
#define QSPI_SPDRR_R3_SHIFT                      (3U)
/*! R3 - Receive Data Bit 3 */
#define QSPI_SPDRR_R3(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R3_SHIFT)) & QSPI_SPDRR_R3_MASK)

#define QSPI_SPDRR_R4_MASK                       (0x10U)
#define QSPI_SPDRR_R4_SHIFT                      (4U)
/*! R4 - Receive Data Bit 4 */
#define QSPI_SPDRR_R4(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R4_SHIFT)) & QSPI_SPDRR_R4_MASK)

#define QSPI_SPDRR_R5_MASK                       (0x20U)
#define QSPI_SPDRR_R5_SHIFT                      (5U)
/*! R5 - Receive Data Bit 5 */
#define QSPI_SPDRR_R5(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R5_SHIFT)) & QSPI_SPDRR_R5_MASK)

#define QSPI_SPDRR_R6_MASK                       (0x40U)
#define QSPI_SPDRR_R6_SHIFT                      (6U)
/*! R6 - Receive Data Bit 6 */
#define QSPI_SPDRR_R6(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R6_SHIFT)) & QSPI_SPDRR_R6_MASK)

#define QSPI_SPDRR_R7_MASK                       (0x80U)
#define QSPI_SPDRR_R7_SHIFT                      (7U)
/*! R7 - Receive Data Bit 7 */
#define QSPI_SPDRR_R7(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R7_SHIFT)) & QSPI_SPDRR_R7_MASK)

#define QSPI_SPDRR_R8_MASK                       (0x100U)
#define QSPI_SPDRR_R8_SHIFT                      (8U)
/*! R8 - Receive Data Bit 8 */
#define QSPI_SPDRR_R8(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R8_SHIFT)) & QSPI_SPDRR_R8_MASK)

#define QSPI_SPDRR_R9_MASK                       (0x200U)
#define QSPI_SPDRR_R9_SHIFT                      (9U)
/*! R9 - Receive Data Bit 9 */
#define QSPI_SPDRR_R9(x)                         (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R9_SHIFT)) & QSPI_SPDRR_R9_MASK)

#define QSPI_SPDRR_R10_MASK                      (0x400U)
#define QSPI_SPDRR_R10_SHIFT                     (10U)
/*! R10 - Receive Data Bit 10 */
#define QSPI_SPDRR_R10(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R10_SHIFT)) & QSPI_SPDRR_R10_MASK)

#define QSPI_SPDRR_R11_MASK                      (0x800U)
#define QSPI_SPDRR_R11_SHIFT                     (11U)
/*! R11 - Receive Data Bit 11 */
#define QSPI_SPDRR_R11(x)                        (((uint16_t)(((uint16_t)(x)) << QSPI_SPDRR_R11_SHIFT)) & QSPI_SPDRR_R11_MASK)

